In [2]:
import numpy as np
import pandas as pd

In [3]:
#indexing into a DataFrame
data1 = pd.DataFrame(np.arange(16).reshape((4, 4)),
index=['paris', 'belgium', 'vienna', 'basel'],
columns=['one', 'two', 'three', 'four'])

In [4]:
data1.head(2)

         one  two  three  four
paris      0    1      2     3
belgium    4    5      6     7

In [5]:
#indexing
data1['two']

paris       1
belgium     5
vienna      9
basel      13
Name: two, dtype: int32

In [6]:
data1[['three','one']]

         three  one
paris        2    0
belgium      6    4
vienna      10    8
basel       14   12

In [7]:
data1[:2]

         one  two  three  four
paris      0    1      2     3
belgium    4    5      6     7

In [8]:
data1[data1['three'] > 5]

         one  two  three  four
belgium    4    5      6     7
vienna     8    9     10    11
basel     12   13     14    15

In [9]:
#indexing with a boolean DataFrame
print(data1 < 5)

           one    two  three   four
paris     True   True   True   True
belgium   True  False  False  False
vienna   False  False  False  False
basel    False  False  False  False

In [10]:
#For DataFrame label-indexing on the rows

print(data1.loc['belgium',['two','three']])

two      5
three    6
Name: belgium, dtype: int32

In [11]:
print(data1.loc[['belgium', 'paris'], ['two','three']])

         two  three
belgium    5      6
paris      1      2

In [12]:
#In the case of DataFrame, alignment is performed on both the rows and the columns:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [13]:
df1.head(2)

         b    c    d
Ohio   0.0  1.0  2.0
Texas  3.0  4.0  5.0

In [14]:
df2.head(2)

        b    d    e
Utah  0.0  1.0  2.0
Ohio  3.0  4.0  5.0

In [15]:
#Adding returns a DataFrame whose index and columns are the unions of the ones in each DataFrame:
print(df1+df2)

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [16]:
#Arithmetic methods with fill values
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))
print(df1+df2)

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [17]:
#using add method
print(df1.add(df2, fill_value=0))

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [18]:
#when reindexing a Series or DataFrame, you can also specify a different fill value
print(df1.reindex(columns=df2.columns, fill_value=0))

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [19]:
#operations between df and searies
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
index=['germany', 'austria', 'russia', 'sweden'])

In [20]:
frame

           b     d     e
germany  0.0   1.0   2.0
austria  3.0   4.0   5.0
russia   6.0   7.0   8.0
sweden   9.0  10.0  11.0

In [21]:
series = frame.loc['germany']

In [22]:
series

b    0.0
d    1.0
e    2.0
Name: germany, dtype: float64

In [23]:
#arithmetic between DataFrame and Series matches the index of the Series
#on the DataFrame's columns, broadcasting down the rows
print(frame - series)

           b    d    e
germany  0.0  0.0  0.0
austria  3.0  3.0  3.0
russia   6.0  6.0  6.0
sweden   9.0  9.0  9.0

In [24]:
#If an index value is not found in either the DataFrame’s columns or the Series’s index,
#the objects will be reindexed to form the union
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
print(frame+series2)

           b   d     e   f
germany  0.0 NaN   3.0 NaN
austria  3.0 NaN   6.0 NaN
russia   6.0 NaN   9.0 NaN
sweden   9.0 NaN  12.0 NaN

In [25]:
#to broadcast over the columns, matching on the rows, use one of the arithmetic methods.
series3 = frame['d']

In [27]:
print(frame)

print(series)

           b     d     e
germany  0.0   1.0   2.0
austria  3.0   4.0   5.0
russia   6.0   7.0   8.0
sweden   9.0  10.0  11.0
b    0.0
d    1.0
e    2.0
Name: germany, dtype: float64

In [28]:
print(frame.sub(series3, axis=0))

           b    d    e
germany -1.0  0.0  1.0
austria -1.0  0.0  1.0
russia  -1.0  0.0  1.0
sweden  -1.0  0.0  1.0

In [33]:
df_student_test_math_data = pd.DataFrame({'student':['Tom','Jack','Dan','Ram','Jeff','David'],
                                         'ID':[10,56,31,85,9,22]
                                         })

In [34]:
df_student_test_science_data = pd.DataFrame({'student':['Tom','Ram','David'],
                                            'ID':[10,85,22]
                                            })

In [35]:
pd.merge(df_student_test_math_data,df_student_test_science_data)

   ID student
0  10     Tom
1  85     Ram
2  22   David

In [36]:
pd.merge(df_student_test_math_data,df_student_test_science_data,on='student')

   ID_x student  ID_y
0    10     Tom    10
1    85     Ram    85
2    22   David    22

In [40]:
pd.merge(df_student_test_math_data,df_student_test_science_data,on='ID',how='right')

   ID student_x student_y
0  10       Tom       Tom
1  85       Ram       Ram
2  22     David     David

In [45]:
(pd.merge(df_student_test_math_data,df_student_test_science_data,on='ID',how='left')).fillna('X')

   ID student_x student_y
0  10       Tom       Tom
1  56      Jack         X
2  31       Dan         X
3  85       Ram       Ram
4   9      Jeff         X
5  22     David     David

In [42]:
pd.merge(df_student_test_math_data,df_student_test_science_data,on='ID',how='outer')

   ID student_x student_y
0  10       Tom       Tom
1  56      Jack       NaN
2  31       Dan       NaN
3  85       Ram       Ram
4   9      Jeff       NaN
5  22     David     David

In [51]:
pd.concat([df_student_test_math_data,df_student_test_science_data],ignore_index=True)

   ID student
0  10     Tom
1  56    Jack
2  31     Dan
3  85     Ram
4   9    Jeff
5  22   David
6  10     Tom
7  85     Ram
8  22   David

In [63]:
df_student_survey_data = pd.DataFrame({'student':['Tom','Jack','Tom','Ram','Jeff','Jack'],
                                         'ID':[10,56,10,85,9,56]
                                         })

In [64]:
df_student_survey_data

   ID student
0  10     Tom
1  56    Jack
2  10     Tom
3  85     Ram
4   9    Jeff
5  56    Jack

In [65]:
df_student_survey_data.duplicated()

0    False
1    False
2     True
3    False
4    False
5     True
dtype: bool

In [66]:
df_student_survey_data.drop_duplicates()

   ID student
0  10     Tom
1  56    Jack
3  85     Ram
4   9    Jeff

In [73]:
df_student_survey_data.drop_duplicates(['student'])

   ID student
0  10     Tom
1  56    Jack
3  85     Ram
4   9    Jeff

In [74]:
df_student_survey_data.drop_duplicates('ID')

   ID student
0  10     Tom
1  56    Jack
3  85     Ram
4   9    Jeff

**#Applying functions/mapping**

In [32]:

frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
index=['germany', 'austria', 'russia', 'sweden'])

In [30]:
frame

                b         d         e
germany  1.585690  0.204538  0.241524
austria -0.491464 -0.121025 -1.536717
russia   0.400383  0.210422  1.396391
sweden  -0.616366  0.038298 -0.240160

In [31]:
np.abs(frame)

                b         d         e
germany  1.585690  0.204538  0.241524
austria  0.491464  0.121025  1.536717
russia   0.400383  0.210422  1.396391
sweden   0.616366  0.038298  0.240160

In [33]:
f = lambda x: x.max() - x.min()

In [34]:
print(frame.apply(f))

b    2.597138
d    0.946691
e    1.730810
dtype: float64

In [35]:
print(frame.apply(f, axis=1))

germany    2.082885
austria    1.678921
russia     2.511373
sweden     1.250120
dtype: float64

In [36]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

In [37]:
print(frame.apply(f))

            b         d         e
min -1.668980  0.078622 -0.750763
max  0.928158  1.025313  0.980048

In [38]:
#Element-wise Python functions can be used, too. To compute a
#formatted string from each floating point value in frame. use applymap
format = lambda x: '%.2f' % x

In [39]:
print(frame.applymap(format))

             b     d      e
germany  -1.06  1.03  -0.71
austria   0.93  0.08  -0.75
russia   -1.67  0.44   0.84
sweden   -0.27  0.58   0.98

In [40]:
print(frame.applymap(lambda n: '%.2f' % n))

             b     d      e
germany  -1.06  1.03  -0.71
austria   0.93  0.08  -0.75
russia   -1.67  0.44   0.84
sweden   -0.27  0.58   0.98

In [41]:
#map method in series for element-wise function
print(frame['e'].map(format))

germany    -0.71
austria    -0.75
russia      0.84
sweden      0.98
Name: e, dtype: object

In [42]:
#Sorting & Ranking
#To sort lexicographically by row or column index, use the sort_index method
ser8 = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
print(ser8)
print(ser8.sort_index())

d    0
a    1
b    2
c    3
dtype: int64
a    1
b    2
c    3
d    0
dtype: int64

In [43]:
#With a DataFrame, you can sort by index on either axis
frame = pd.DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
columns=['d', 'a', 'b', 'c'])

In [44]:
print(frame.sort_index())
print(frame.sort_index(axis=0))
print(frame.sort_index(axis=1))
print(frame.sort_index(axis=1, ascending=False))

       d  a  b  c
one    4  5  6  7
three  0  1  2  3
       d  a  b  c
one    4  5  6  7
three  0  1  2  3
       a  b  c  d
three  1  2  3  0
one    5  6  7  4
       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [45]:
#sorting dataframe by values
import pandas as pd
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [46]:
print(frame)
print(frame.sort_values(by='b'))
print(frame.sort_values(by=['a', 'b']))

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1
   b  a
2 -3  0
3  2  1
0  4  0
1  7  1
   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

__Ranking
Ranking is closely related to sorting, assigning ranks from 1 to all valid data points
in an array. The rank methods for Series and DataFrame breaks ties by assigning
each group the mean rank

Pandas Series.rank() function compute numerical data ranks (1 through n) along axis. 
Equal values are assigned a rank that is the average of the ranks of those values.

 Syntax: Series.rank(axis=0, method=’average’, numeric_only=None, na_option=’keep’, ascending=True, pct=False)

 Parameter :
 axis : index to direct ranking
 method : {‘average’, ‘min’, ‘max’, ‘first’, ‘dense’}
 numeric_only : Include only float, int, boolean data. Valid only for DataFrame or Panel objects
 na_option : {‘keep’, ‘top’, ‘bottom’}
 ascending : False for ranks by high (1) to low (N)
 pct : Computes percentage rank of data

 Returns : ranks : same type as caller

In [47]:
ser10 = pd.Series([7,-5,7,4,2,0,4])
print(ser10)
print(ser10.rank())
print(ser10.rank(ascending = False))

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64
0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64
0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

In [48]:
#Ranks can also be assigned according to the order they’re observed in the data
print(ser10.rank(method='first'))
print(ser10.rank(ascending=False, method='max'))

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64
0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [49]:
#DataFrame can compute ranks over the rows or the columns:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
'c': [-2, 5, 8, -2.5]})
print(frame)
print(frame.rank(axis=1))

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5
     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

**#working with real data**

In [58]:
import pandas as pd
power = pd.read_csv("../../Datasets/comm-power.csv")
power.columns
power.head(2)

  START_DATE      VALUE
0  15-Dec-17  32.009998
1  15-Dec-17  30.930000

In [59]:
df = pd.DataFrame(power)
df.index   #shows RangeIndex(start=0, stop=37623, step=1
df.columns
df.head()
df.agg({'VALUE':['mean']}),
df.agg({'VALUE':['max']}),
df.agg({'VALUE':['min']}),
df.agg({'VALUE':['std']})
df['year'] = pd.DatetimeIndex(df['START_DATE']).year
df.head
df.columns
df['month'] = pd.DatetimeIndex(df['START_DATE']).month
df.head
df.columns
df['day'] = pd.DatetimeIndex(df['START_DATE']).day
df.head
df.columns
df.groupby(['year']).size()
df.groupby(['year']).count()
df.groupby(['year']).agg({'VALUE':['mean']})

          VALUE
           mean
year
2017  31.541348
2018  38.183961
2019  36.200000
2020  36.250000
2021  36.800000
2022  41.650659

**#working with bankdata**

In [60]:
import pandas as pd
import numpy as np
x = pd.read_csv("../../Datasets/Bank_full.csv")
#reading from web to create dataframe
#x = pd.read_csv('https://raw.githubusercontent.com/ajaykuma/Datasets/master/Bank_full.csv')
df = pd.DataFrame(x)

In [61]:
df.head(2)

,serNo,age,job,marital,education,defaulter,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,1,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown,no
1,2,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown,no

In [ ]:

print(df.columns)
print(x.values)
df[df.age > 80]
df[df.age > 80].education
df[df.age > 80].education.unique()
df.mean()
df.median()
df.mode(axis=1)
df.mode(axis=0)
df[(df.age > 80) & (df.marital=='married')]
df[(df.age > 80) & (df.marital=='married')].sort_values('balance',ascending=False)
df[(df.age.isin(['82','15','17','35']))].head()
df.groupby(['age','y']).size()
df.groupby(['age','y']).size()
#count displays number of non-null/NAN values
df.groupby(['age','y']).count()

#If we want to use different fields for sorting, or DESC instead of ASC
# we want to sort by our calculated field (size), this field needs to become part of 
# the DataFrame. After grouping in Pandas, we get back a different type, called 
# a GroupByObject. 
# So we need to convert it back to a DataFrame. With .reset_index(), we restart 
# row numbering for our data frame.
df.groupby(['marital', 'y']).size().to_frame('size').reset_index().sort_values(['marital', 'size'], ascending=[True, False])

#additionally filter grouped data using a HAVING condition. In Pandas, 
# you can use .filter() and provide a Python function (or a lambda) 
# that will return True if the group should be included into the result.

df[df.marital == 'married'].groupby('y').filter(lambda g: len(g) > 1000) \
.groupby('y').size().sort_values(ascending=False)

#creating new df
df1 = df.groupby(['age','y']).count()

#now getting top N records
df1.nlargest(10, columns='marital')

#getting the next 10 after the top 10
df1.nlargest(20, columns='marital').tail(10)

df[df.y == 'yes'].agg({'age':['mean']})
df.groupby('y').agg({'age':['mean']})

#Use .merge() to join Pandas dataframes. You need to provide which columns to join on
#  (left_on and right_on), and join type: inner (default), 
# left (corresponds to LEFT OUTER in SQL), right (RIGHT OUTER), 
# or outer (FULL OUTER).

df2 = df[(df.age.isin(['82','15','17','35']))]
df2.merge(df[df.y == 'yes'][['age']], left_on='age', right_on='age', how='inner')[['age','marital','y']]

pd.concat([df[df.y == 'no'][['age', 'job','balance']], df[df.y == 'yes'][['job', 'contact']]])

#if inserting (via concat)
df1 = pd.DataFrame({'id': [1, 2], 'name': ['Harry ', 'Ron ']})
df2 = pd.DataFrame({'id': [3], 'name': ['Peter']})
df3 = pd.concat([df1, df2]).reset_index(drop=True)
df3